lidDrivenCavity/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0.01;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-05;
        relTol          0.01;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p       1e-6;
        U       1e-5;
    }
}

// These two dictionaries are only shown here as examples
// They are not used because we run 'simpleFoam'
PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;

	//pRefCell        0;
	//pRefValue       0;
}

PIMPLE
{
    nOuterCorrectors      		2;
    nCorrectors     		 	1;
    nNonOrthogonalCorrectors 	2;

	//pRefCell        0;
	//pRefValue       0;
}

relaxationFactors
{
    fields
    {
        p   0.3;
    }
    equations
    {
        U   0.8;
    }
}


// ************************************************************************* //
